app/views/questions/index.html.erb


      <% if question.answers.any? %>
---
SELECT  1 AS one FROM "answers" WHERE "answers"."question_id" = $1 LIMIT $2  [["question_id", 1], ["LIMIT", 1]]