app/controllers/alumno/asignaturas_controller.rb

  def index
    @asignaturas = Asignatura.all
---
SELECT "asignaturas".* FROM "asignaturas"

    def set_asignatura
      @asignatura = Asignatura.find(params[:id])
---
SELECT  "asignaturas".* FROM "asignaturas" WHERE "asignaturas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]