app/controllers/alumno/notas_controller.rb

  def index
    @notas = Nota.all
---
SELECT "notas".* FROM "notas"