app/controllers/profesor/cursos_controller.rb

SELECT "cursos".* FROM "cursos"
---
  def index
    @cursos = Curso.all