app/controllers/profesor/notas_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @nota = Nota.new
    @user = params[:user]
    @asignatura = params[:asignatura]
    @alumno = User.find(@user)