app/controllers/answers_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "answers" ("content", "question_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "Es la proxima semana"], ["question_id", 1], ["user_id", 1], ["created_at", 2017-07-20 00:38:11 UTC], ["updated_at", 2017-07-20 00:38:11 UTC]]
---
  def create
    @question       = Question.find(params[:question_id])
    @answer         = @question.answers.build(answers_params)
    @answer.user    = current_user
    @answer.save