app/controllers/events_controller.rb

  def index
    @events = Event.where(start: params[:start]..params[:end])
---
SELECT "events".* FROM "events" WHERE ("events"."start" BETWEEN ? AND ?)  [["start", "2017-06-25"], ["start", "2017-08-06"]]