app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "description", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "ISO"], ["description", "PDF iso"], ["image", "179786_iso15504.pdf"], ["created_at", 2017-07-20 00:58:06 UTC], ["updated_at", 2017-07-20 00:58:06 UTC]]