app/controllers/questions_controller.rb

  def create
    @user = current_user
    @question = @user.questions.build(question_params)

    respond_to do |format|
      if @question.save
---
INSERT INTO "questions" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "La prueba es mañana?"], ["user_id", 1], ["created_at", 2017-07-20 00:37:57 UTC], ["updated_at", 2017-07-20 00:37:57 UTC]]